eamodio.gitlens
formulahendry.code-runner
github.copilot
github.copilot-chat
github.github-vscode-theme
james-yu.latex-workshop
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.remote-server
myaaghubi.onedarkpro-mariana-vscode
twxs.cmake
vscodevim.vim
yarimit.vscode-charcode-ext
zhuangtongfa.material-theme
